#+TITLE: Notes on Nix
#+CATEGORY: note
#+TAGS: nix
 
** Using Nix with Org-Mode

#+begin_src shell
nix eval --impure --raw --expr '
let
  emacs-overlay = (builtins.getFlake "github:nix-community/emacs-overlay");
  emacs = emacs-overlay.packages.x86_64-linux.emacsGit;
in
"update again when ${emacs.pkgs.org.version} > 9.6.1"
'
#+end_src

#+RESULTS:
: update again when 9.6.1 > 9.6.1


